InformationRegisters/ЛБ_НастройкаДопустимыхВидовОгранки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_НастройкаДопустимыхВидовОгранки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Формула</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособРасчетаВеса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_СпособыРасчетаВесаДрагоценныхКамней</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ОграниченныйСписокВидовОгранки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ВидКамня</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ДрагоценныеКамни</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФормаОгранки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ФормыОгранки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОгранки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ВидыОгранки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ЛБ_СпособыРасчетаВесаДрагоценныхКамней.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_СпособыРасчетаВесаДрагоценныхКамней</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоТаблице</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоФормуле</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Вручную</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/ЛБ_НастройкаДопустимыхВидовОгранки/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ВидКамня") тогда 
		Запись.ВидКамня = Параметры.ВидКамня;  
		Запись.СпособРасчетаВеса = Перечисления.ЛБ_СпособыРасчетаВесаДрагоценныхКамней.ПоФормуле;
	КонецЕсли;	
	УстановитьВидимость();
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимость()
	Если Запись.СпособРасчетаВеса = Перечисления.ЛБ_СпособыРасчетаВесаДрагоценныхКамней.ПоФормуле Тогда 
		Элементы.Формула.Видимость = Истина;
	Иначе 
		Элементы.Формула.Видимость = ложь;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура СпособРасчетаВесаПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если НЕ Запись.СпособРасчетаВеса = ПредопределенноеЗначение("Перечисление.ЛБ_СпособыРасчетаВесаДрагоценныхКамней.ПоФормуле") Тогда 
		Если НЕ ПустаяСтрока(Запись.Формула) Тогда
		    Запись.Формула = ""; 
		КонецЕсли;	
	ИначеЕсли ПустаяСтрока(Запись.Формула) тогда
		Сообщить("Не  определена формула расчета веса!");
		Отказ = Истина;
	КонецЕсли;	
КонецПроцедуры
